; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=312, out_folder=htg/blocksworld/training, instance_id=64, seed=2088, goal_proportion=0.03

(define (problem blocksworld-64)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 - object)
 (:init 
    (arm-empty)
    (clear b34)
    (on b34 b144)
    (on b144 b131)
    (on b131 b290)
    (on b290 b220)
    (on b220 b27)
    (on b27 b288)
    (on b288 b89)
    (on b89 b244)
    (on b244 b190)
    (on b190 b30)
    (on b30 b147)
    (on b147 b23)
    (on b23 b233)
    (on b233 b205)
    (on b205 b295)
    (on b295 b293)
    (on b293 b298)
    (on b298 b16)
    (on b16 b118)
    (on-table b118)
    (clear b98)
    (on b98 b255)
    (on b255 b71)
    (on b71 b175)
    (on b175 b125)
    (on b125 b311)
    (on-table b311)
    (clear b183)
    (on b183 b306)
    (on b306 b165)
    (on-table b165)
    (clear b248)
    (on-table b248)
    (clear b33)
    (on b33 b237)
    (on b237 b82)
    (on b82 b214)
    (on b214 b173)
    (on-table b173)
    (clear b273)
    (on b273 b103)
    (on b103 b37)
    (on-table b37)
    (clear b22)
    (on b22 b137)
    (on-table b137)
    (clear b235)
    (on-table b235)
    (clear b133)
    (on b133 b48)
    (on b48 b32)
    (on-table b32)
    (clear b21)
    (on b21 b149)
    (on b149 b63)
    (on b63 b154)
    (on b154 b261)
    (on b261 b121)
    (on b121 b275)
    (on b275 b224)
    (on b224 b266)
    (on b266 b155)
    (on b155 b14)
    (on-table b14)
    (clear b282)
    (on b282 b58)
    (on b58 b75)
    (on b75 b222)
    (on-table b222)
    (clear b246)
    (on b246 b164)
    (on b164 b51)
    (on b51 b167)
    (on-table b167)
    (clear b264)
    (on b264 b67)
    (on b67 b143)
    (on b143 b176)
    (on b176 b296)
    (on b296 b258)
    (on b258 b213)
    (on b213 b40)
    (on b40 b13)
    (on b13 b119)
    (on b119 b250)
    (on-table b250)
    (clear b223)
    (on b223 b73)
    (on b73 b39)
    (on-table b39)
    (clear b260)
    (on b260 b116)
    (on-table b116)
    (clear b156)
    (on b156 b304)
    (on b304 b124)
    (on-table b124)
    (clear b189)
    (on b189 b111)
    (on b111 b93)
    (on b93 b42)
    (on b42 b136)
    (on b136 b66)
    (on-table b66)
    (clear b64)
    (on b64 b90)
    (on b90 b4)
    (on b4 b81)
    (on b81 b104)
    (on b104 b268)
    (on-table b268)
    (clear b302)
    (on b302 b161)
    (on-table b161)
    (clear b97)
    (on-table b97)
    (clear b310)
    (on b310 b292)
    (on b292 b174)
    (on b174 b17)
    (on b17 b242)
    (on b242 b209)
    (on b209 b10)
    (on-table b10)
    (clear b226)
    (on b226 b115)
    (on-table b115)
    (clear b43)
    (on-table b43)
    (clear b184)
    (on b184 b38)
    (on b38 b12)
    (on b12 b7)
    (on b7 b139)
    (on b139 b228)
    (on b228 b234)
    (on b234 b230)
    (on b230 b286)
    (on b286 b207)
    (on b207 b203)
    (on b203 b254)
    (on-table b254)
    (clear b195)
    (on b195 b18)
    (on b18 b134)
    (on b134 b179)
    (on b179 b70)
    (on-table b70)
    (clear b77)
    (on-table b77)
    (clear b26)
    (on-table b26)
    (clear b11)
    (on b11 b126)
    (on b126 b145)
    (on-table b145)
    (clear b151)
    (on b151 b162)
    (on b162 b140)
    (on b140 b297)
    (on b297 b132)
    (on b132 b241)
    (on b241 b308)
    (on b308 b94)
    (on b94 b45)
    (on b45 b91)
    (on-table b91)
    (clear b53)
    (on b53 b157)
    (on-table b157)
    (clear b107)
    (on-table b107)
    (clear b170)
    (on b170 b160)
    (on b160 b79)
    (on-table b79)
    (clear b76)
    (on b76 b49)
    (on b49 b138)
    (on-table b138)
    (clear b281)
    (on b281 b150)
    (on b150 b168)
    (on b168 b85)
    (on-table b85)
    (clear b171)
    (on-table b171)
    (clear b20)
    (on b20 b31)
    (on-table b31)
    (clear b259)
    (on b259 b84)
    (on b84 b169)
    (on b169 b299)
    (on b299 b199)
    (on b199 b122)
    (on b122 b287)
    (on b287 b129)
    (on b129 b35)
    (on-table b35)
    (clear b177)
    (on b177 b106)
    (on b106 b114)
    (on b114 b36)
    (on b36 b227)
    (on b227 b216)
    (on b216 b240)
    (on b240 b193)
    (on b193 b148)
    (on-table b148)
    (clear b196)
    (on b196 b153)
    (on b153 b78)
    (on b78 b256)
    (on b256 b277)
    (on b277 b100)
    (on b100 b178)
    (on b178 b285)
    (on b285 b5)
    (on-table b5)
    (clear b181)
    (on b181 b238)
    (on b238 b307)
    (on b307 b60)
    (on b60 b59)
    (on-table b59)
    (clear b105)
    (on b105 b236)
    (on b236 b128)
    (on b128 b50)
    (on b50 b88)
    (on b88 b231)
    (on b231 b127)
    (on b127 b182)
    (on b182 b274)
    (on b274 b141)
    (on-table b141)
    (clear b8)
    (on-table b8)
    (clear b245)
    (on b245 b172)
    (on b172 b28)
    (on b28 b272)
    (on-table b272)
    (clear b197)
    (on-table b197)
    (clear b3)
    (on b3 b212)
    (on b212 b225)
    (on b225 b166)
    (on b166 b83)
    (on b83 b110)
    (on b110 b158)
    (on-table b158)
    (clear b113)
    (on-table b113)
    (clear b123)
    (on b123 b1)
    (on-table b1)
    (clear b262)
    (on b262 b229)
    (on b229 b301)
    (on b301 b210)
    (on-table b210)
    (clear b263)
    (on-table b263)
    (clear b24)
    (on b24 b41)
    (on b41 b251)
    (on b251 b61)
    (on b61 b270)
    (on-table b270)
    (clear b300)
    (on b300 b146)
    (on b146 b217)
    (on b217 b187)
    (on b187 b6)
    (on b6 b247)
    (on b247 b87)
    (on b87 b47)
    (on b47 b192)
    (on b192 b19)
    (on b19 b232)
    (on b232 b188)
    (on b188 b278)
    (on b278 b202)
    (on b202 b267)
    (on b267 b142)
    (on b142 b55)
    (on b55 b159)
    (on b159 b252)
    (on b252 b44)
    (on b44 b265)
    (on b265 b135)
    (on b135 b72)
    (on b72 b206)
    (on b206 b243)
    (on b243 b269)
    (on-table b269)
    (clear b69)
    (on b69 b102)
    (on b102 b180)
    (on-table b180)
    (clear b309)
    (on b309 b2)
    (on b2 b120)
    (on b120 b96)
    (on b96 b74)
    (on-table b74)
    (clear b86)
    (on b86 b25)
    (on b25 b186)
    (on b186 b201)
    (on b201 b219)
    (on b219 b280)
    (on b280 b191)
    (on b191 b221)
    (on b221 b92)
    (on b92 b109)
    (on b109 b218)
    (on-table b218)
    (clear b68)
    (on b68 b163)
    (on b163 b283)
    (on b283 b95)
    (on b95 b211)
    (on-table b211)
    (clear b46)
    (on b46 b62)
    (on b62 b80)
    (on b80 b56)
    (on-table b56)
    (clear b29)
    (on b29 b130)
    (on b130 b271)
    (on-table b271)
    (clear b239)
    (on b239 b117)
    (on b117 b305)
    (on b305 b185)
    (on b185 b204)
    (on-table b204)
    (clear b291)
    (on b291 b312)
    (on b312 b200)
    (on b200 b279)
    (on b279 b257)
    (on b257 b99)
    (on b99 b52)
    (on b52 b303)
    (on b303 b215)
    (on b215 b253)
    (on b253 b152)
    (on b152 b208)
    (on b208 b57)
    (on b57 b65)
    (on b65 b15)
    (on b15 b284)
    (on b284 b9)
    (on b9 b108)
    (on b108 b276)
    (on b276 b198)
    (on-table b198)
    (clear b54)
    (on b54 b294)
    (on b294 b101)
    (on b101 b194)
    (on b194 b112)
    (on-table b112)
    (clear b249)
    (on b249 b289)
    (on-table b289))
 (:goal  (and 
    (clear b5)
    (on b5 b6)
    (on-table b6)
    (clear b8)
    (on b8 b4)
    (on b4 b1)
    (on b1 b9)
    (on-table b9)
    (clear b7)
    (on b7 b3)
    (on-table b3)
    (clear b2)
    (on-table b2))))

; plan
1. (unstack b3 b212)
   deleted: (on b3 b212) (clear b3) (arm-empty)
   added: (holding b3) (clear b212)
   goals met: 1 of 13
2. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 2 of 13
3. (unstack b123 b1)
   deleted: (on b123 b1) (clear b123) (arm-empty)
   added: (holding b123) (clear b1)
   goals met: 2 of 13
4. (putdown b123)
   deleted: (holding b123)
   added: (clear b123) (arm-empty) (on-table b123)
   goals met: 2 of 13
5. (unstack b184 b38)
   deleted: (on b184 b38) (clear b184) (arm-empty)
   added: (holding b184) (clear b38)
   goals met: 2 of 13
6. (putdown b184)
   deleted: (holding b184)
   added: (clear b184) (arm-empty) (on-table b184)
   goals met: 2 of 13
7. (unstack b196 b153)
   deleted: (on b196 b153) (clear b196) (arm-empty)
   added: (holding b196) (clear b153)
   goals met: 2 of 13
8. (putdown b196)
   deleted: (holding b196)
   added: (clear b196) (arm-empty) (on-table b196)
   goals met: 2 of 13
9. (unstack b153 b78)
   deleted: (on b153 b78) (clear b153) (arm-empty)
   added: (holding b153) (clear b78)
   goals met: 2 of 13
10. (putdown b153)
   deleted: (holding b153)
   added: (clear b153) (arm-empty) (on-table b153)
   goals met: 2 of 13
11. (unstack b291 b312)
   deleted: (on b291 b312) (clear b291) (arm-empty)
   added: (holding b291) (clear b312)
   goals met: 2 of 13
12. (putdown b291)
   deleted: (holding b291)
   added: (clear b291) (arm-empty) (on-table b291)
   goals met: 2 of 13
13. (unstack b300 b146)
   deleted: (on b300 b146) (clear b300) (arm-empty)
   added: (holding b300) (clear b146)
   goals met: 2 of 13
14. (putdown b300)
   deleted: (holding b300)
   added: (clear b300) (arm-empty) (on-table b300)
   goals met: 2 of 13
15. (unstack b146 b217)
   deleted: (on b146 b217) (clear b146) (arm-empty)
   added: (holding b146) (clear b217)
   goals met: 2 of 13
16. (putdown b146)
   deleted: (holding b146)
   added: (clear b146) (arm-empty) (on-table b146)
   goals met: 2 of 13
17. (unstack b217 b187)
   deleted: (on b217 b187) (clear b217) (arm-empty)
   added: (holding b217) (clear b187)
   goals met: 2 of 13
18. (putdown b217)
   deleted: (holding b217)
   added: (clear b217) (arm-empty) (on-table b217)
   goals met: 2 of 13
19. (unstack b187 b6)
   deleted: (on b187 b6) (clear b187) (arm-empty)
   added: (holding b187) (clear b6)
   goals met: 2 of 13
20. (putdown b187)
   deleted: (holding b187)
   added: (clear b187) (arm-empty) (on-table b187)
   goals met: 2 of 13
21. (unstack b6 b247)
   deleted: (on b6 b247) (clear b6) (arm-empty)
   added: (holding b6) (clear b247)
   goals met: 2 of 13
22. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 3 of 13
23. (unstack b309 b2)
   deleted: (on b309 b2) (clear b309) (arm-empty)
   added: (holding b309) (clear b2)
   goals met: 4 of 13
24. (putdown b309)
   deleted: (holding b309)
   added: (clear b309) (arm-empty) (on-table b309)
   goals met: 4 of 13
25. (unstack b2 b120)
   deleted: (on b2 b120) (clear b2) (arm-empty)
   added: (holding b2) (clear b120)
   goals met: 3 of 13
26. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 5 of 13
27. (unstack b312 b200)
   deleted: (on b312 b200) (clear b312) (arm-empty)
   added: (holding b312) (clear b200)
   goals met: 5 of 13
28. (putdown b312)
   deleted: (holding b312)
   added: (clear b312) (arm-empty) (on-table b312)
   goals met: 5 of 13
29. (unstack b200 b279)
   deleted: (on b200 b279) (clear b200) (arm-empty)
   added: (holding b200) (clear b279)
   goals met: 5 of 13
30. (putdown b200)
   deleted: (holding b200)
   added: (clear b200) (arm-empty) (on-table b200)
   goals met: 5 of 13
31. (unstack b279 b257)
   deleted: (on b279 b257) (clear b279) (arm-empty)
   added: (holding b279) (clear b257)
   goals met: 5 of 13
32. (putdown b279)
   deleted: (holding b279)
   added: (clear b279) (arm-empty) (on-table b279)
   goals met: 5 of 13
33. (unstack b257 b99)
   deleted: (on b257 b99) (clear b257) (arm-empty)
   added: (holding b257) (clear b99)
   goals met: 5 of 13
34. (putdown b257)
   deleted: (holding b257)
   added: (clear b257) (arm-empty) (on-table b257)
   goals met: 5 of 13
35. (unstack b38 b12)
   deleted: (on b38 b12) (clear b38) (arm-empty)
   added: (holding b38) (clear b12)
   goals met: 5 of 13
36. (putdown b38)
   deleted: (holding b38)
   added: (clear b38) (arm-empty) (on-table b38)
   goals met: 5 of 13
37. (unstack b12 b7)
   deleted: (on b12 b7) (clear b12) (arm-empty)
   added: (holding b12) (clear b7)
   goals met: 6 of 13
38. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 6 of 13
39. (unstack b64 b90)
   deleted: (on b64 b90) (clear b64) (arm-empty)
   added: (holding b64) (clear b90)
   goals met: 6 of 13
40. (putdown b64)
   deleted: (holding b64)
   added: (clear b64) (arm-empty) (on-table b64)
   goals met: 6 of 13
41. (unstack b78 b256)
   deleted: (on b78 b256) (clear b78) (arm-empty)
   added: (holding b78) (clear b256)
   goals met: 6 of 13
42. (putdown b78)
   deleted: (holding b78)
   added: (clear b78) (arm-empty) (on-table b78)
   goals met: 6 of 13
43. (unstack b256 b277)
   deleted: (on b256 b277) (clear b256) (arm-empty)
   added: (holding b256) (clear b277)
   goals met: 6 of 13
44. (putdown b256)
   deleted: (holding b256)
   added: (clear b256) (arm-empty) (on-table b256)
   goals met: 6 of 13
45. (unstack b277 b100)
   deleted: (on b277 b100) (clear b277) (arm-empty)
   added: (holding b277) (clear b100)
   goals met: 6 of 13
46. (putdown b277)
   deleted: (holding b277)
   added: (clear b277) (arm-empty) (on-table b277)
   goals met: 6 of 13
47. (unstack b100 b178)
   deleted: (on b100 b178) (clear b100) (arm-empty)
   added: (holding b100) (clear b178)
   goals met: 6 of 13
48. (putdown b100)
   deleted: (holding b100)
   added: (clear b100) (arm-empty) (on-table b100)
   goals met: 6 of 13
49. (unstack b178 b285)
   deleted: (on b178 b285) (clear b178) (arm-empty)
   added: (holding b178) (clear b285)
   goals met: 6 of 13
50. (putdown b178)
   deleted: (holding b178)
   added: (clear b178) (arm-empty) (on-table b178)
   goals met: 6 of 13
51. (unstack b285 b5)
   deleted: (on b285 b5) (clear b285) (arm-empty)
   added: (holding b285) (clear b5)
   goals met: 7 of 13
52. (putdown b285)
   deleted: (holding b285)
   added: (clear b285) (arm-empty) (on-table b285)
   goals met: 7 of 13
53. (unstack b90 b4)
   deleted: (on b90 b4) (clear b90) (arm-empty)
   added: (holding b90) (clear b4)
   goals met: 7 of 13
54. (putdown b90)
   deleted: (holding b90)
   added: (clear b90) (arm-empty) (on-table b90)
   goals met: 7 of 13
55. (unstack b99 b52)
   deleted: (on b99 b52) (clear b99) (arm-empty)
   added: (holding b99) (clear b52)
   goals met: 7 of 13
56. (putdown b99)
   deleted: (holding b99)
   added: (clear b99) (arm-empty) (on-table b99)
   goals met: 7 of 13
57. (unstack b52 b303)
   deleted: (on b52 b303) (clear b52) (arm-empty)
   added: (holding b52) (clear b303)
   goals met: 7 of 13
58. (putdown b52)
   deleted: (holding b52)
   added: (clear b52) (arm-empty) (on-table b52)
   goals met: 7 of 13
59. (unstack b303 b215)
   deleted: (on b303 b215) (clear b303) (arm-empty)
   added: (holding b303) (clear b215)
   goals met: 7 of 13
60. (putdown b303)
   deleted: (holding b303)
   added: (clear b303) (arm-empty) (on-table b303)
   goals met: 7 of 13
61. (unstack b215 b253)
   deleted: (on b215 b253) (clear b215) (arm-empty)
   added: (holding b215) (clear b253)
   goals met: 7 of 13
62. (putdown b215)
   deleted: (holding b215)
   added: (clear b215) (arm-empty) (on-table b215)
   goals met: 7 of 13
63. (unstack b253 b152)
   deleted: (on b253 b152) (clear b253) (arm-empty)
   added: (holding b253) (clear b152)
   goals met: 7 of 13
64. (putdown b253)
   deleted: (holding b253)
   added: (clear b253) (arm-empty) (on-table b253)
   goals met: 7 of 13
65. (unstack b152 b208)
   deleted: (on b152 b208) (clear b152) (arm-empty)
   added: (holding b152) (clear b208)
   goals met: 7 of 13
66. (putdown b152)
   deleted: (holding b152)
   added: (clear b152) (arm-empty) (on-table b152)
   goals met: 7 of 13
67. (unstack b208 b57)
   deleted: (on b208 b57) (clear b208) (arm-empty)
   added: (holding b208) (clear b57)
   goals met: 7 of 13
68. (putdown b208)
   deleted: (holding b208)
   added: (clear b208) (arm-empty) (on-table b208)
   goals met: 7 of 13
69. (unstack b57 b65)
   deleted: (on b57 b65) (clear b57) (arm-empty)
   added: (holding b57) (clear b65)
   goals met: 7 of 13
70. (putdown b57)
   deleted: (holding b57)
   added: (clear b57) (arm-empty) (on-table b57)
   goals met: 7 of 13
71. (unstack b65 b15)
   deleted: (on b65 b15) (clear b65) (arm-empty)
   added: (holding b65) (clear b15)
   goals met: 7 of 13
72. (putdown b65)
   deleted: (holding b65)
   added: (clear b65) (arm-empty) (on-table b65)
   goals met: 7 of 13
73. (unstack b15 b284)
   deleted: (on b15 b284) (clear b15) (arm-empty)
   added: (holding b15) (clear b284)
   goals met: 7 of 13
74. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 7 of 13
75. (unstack b284 b9)
   deleted: (on b284 b9) (clear b284) (arm-empty)
   added: (holding b284) (clear b9)
   goals met: 7 of 13
76. (putdown b284)
   deleted: (holding b284)
   added: (clear b284) (arm-empty) (on-table b284)
   goals met: 7 of 13
77. (unstack b9 b108)
   deleted: (on b9 b108) (clear b9) (arm-empty)
   added: (holding b9) (clear b108)
   goals met: 7 of 13
78. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 8 of 13
79. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 8 of 13
80. (stack b1 b9)
   deleted: (clear b9) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b9)
   goals met: 9 of 13
81. (unstack b4 b81)
   deleted: (on b4 b81) (clear b4) (arm-empty)
   added: (holding b4) (clear b81)
   goals met: 9 of 13
82. (stack b4 b1)
   deleted: (clear b1) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b1)
   goals met: 10 of 13
83. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 9 of 13
84. (stack b5 b6)
   deleted: (clear b6) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b6)
   goals met: 11 of 13
85. (unstack b7 b139)
   deleted: (on b7 b139) (clear b7) (arm-empty)
   added: (holding b7) (clear b139)
   goals met: 10 of 13
86. (stack b7 b3)
   deleted: (clear b3) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b3)
   goals met: 12 of 13
87. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 11 of 13
88. (stack b8 b4)
   deleted: (clear b4) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b4)
   goals met: 13 of 13
